Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_cnano/pic32cm_jh01_cnano_smart_appliance_control/firmware/src/packs/PIC32CM5164JH01048_DFP/component/nvmctrl.h
#define NVMCTRL_PARAM_NVMP_Pos                _UINT32_(0)                                          /* (NVMCTRL_PARAM) NVM Pages Position */
#define NVMCTRL_PARAM_NVMP_Msk                (_UINT32_(0xFFFF) << NVMCTRL_PARAM_NVMP_Pos)         /* (NVMCTRL_PARAM) NVM Pages Mask */
#define NVMCTRL_PARAM_NVMP(value)             (NVMCTRL_PARAM_NVMP_Msk & (_UINT32_(value) << NVMCTRL_PARAM_NVMP_Pos)) /* Assigment of value for NVMP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_PSZ_Pos                 _UINT32_(16)                                         /* (NVMCTRL_PARAM) Page Size Position */
#define NVMCTRL_PARAM_PSZ_Msk                 (_UINT32_(0x7) << NVMCTRL_PARAM_PSZ_Pos)             /* (NVMCTRL_PARAM) Page Size Mask */
#define NVMCTRL_PARAM_PSZ(value)              (NVMCTRL_PARAM_PSZ_Msk & (_UINT32_(value) << NVMCTRL_PARAM_PSZ_Pos)) /* Assigment of value for PSZ in the NVMCTRL_PARAM register */
#define   NVMCTRL_PARAM_PSZ_8_Val             _UINT32_(0x0)                                        /* (NVMCTRL_PARAM) 8 bytes  */
#define   NVMCTRL_PARAM_PSZ_16_Val            _UINT32_(0x1)                                        /* (NVMCTRL_PARAM) 16 bytes  */
#define   NVMCTRL_PARAM_PSZ_32_Val            _UINT32_(0x2)                                        /* (NVMCTRL_PARAM) 32 bytes  */
#define   NVMCTRL_PARAM_PSZ_64_Val            _UINT32_(0x3)                                        /* (NVMCTRL_PARAM) 64 bytes  */
#define   NVMCTRL_PARAM_PSZ_128_Val           _UINT32_(0x4)                                        /* (NVMCTRL_PARAM) 128 bytes  */
#define   NVMCTRL_PARAM_PSZ_256_Val           _UINT32_(0x5)                                        /* (NVMCTRL_PARAM) 256 bytes  */
#define   NVMCTRL_PARAM_PSZ_512_Val           _UINT32_(0x6)                                        /* (NVMCTRL_PARAM) 512 bytes  */
#define   NVMCTRL_PARAM_PSZ_1024_Val          _UINT32_(0x7)                                        /* (NVMCTRL_PARAM) 1024 bytes  */
#define NVMCTRL_PARAM_PSZ_8                   (NVMCTRL_PARAM_PSZ_8_Val << NVMCTRL_PARAM_PSZ_Pos)   /* (NVMCTRL_PARAM) 8 bytes Position  */
#define NVMCTRL_PARAM_PSZ_16                  (NVMCTRL_PARAM_PSZ_16_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 16 bytes Position  */
#define NVMCTRL_PARAM_PSZ_32                  (NVMCTRL_PARAM_PSZ_32_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 32 bytes Position  */
#define NVMCTRL_PARAM_PSZ_64                  (NVMCTRL_PARAM_PSZ_64_Val << NVMCTRL_PARAM_PSZ_Pos)  /* (NVMCTRL_PARAM) 64 bytes Position  */
#define NVMCTRL_PARAM_PSZ_128                 (NVMCTRL_PARAM_PSZ_128_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 128 bytes Position  */
#define NVMCTRL_PARAM_PSZ_256                 (NVMCTRL_PARAM_PSZ_256_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 256 bytes Position  */
#define NVMCTRL_PARAM_PSZ_512                 (NVMCTRL_PARAM_PSZ_512_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 512 bytes Position  */
#define NVMCTRL_PARAM_PSZ_1024                (NVMCTRL_PARAM_PSZ_1024_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 1024 bytes Position  */
#define NVMCTRL_PARAM_DFP_Pos                 _UINT32_(20)                                         /* (NVMCTRL_PARAM) Data Flash Pages Position */
#define NVMCTRL_PARAM_DFP_Msk                 (_UINT32_(0xFFF) << NVMCTRL_PARAM_DFP_Pos)           /* (NVMCTRL_PARAM) Data Flash Pages Mask */
#define NVMCTRL_PARAM_DFP(value)              (NVMCTRL_PARAM_DFP_Msk & (_UINT32_(value) << NVMCTRL_PARAM_DFP_Pos)) /* Assigment of value for DFP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_Msk                     _UINT32_(0xFFF7FFFF)                                 /* (NVMCTRL_PARAM) Register Mask  */


/* -------- NVMCTRL_INTENCLR : (NVMCTRL Offset: 0x0C) (R/W 32) Interrupt Enable Clear -------- */
#define NVMCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (NVMCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define NVMCTRL_INTENCLR_READY_Pos            _UINT32_(0)                                          /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENCLR_READY_Msk            (_UINT32_(0x1) << NVMCTRL_INTENCLR_READY_Pos)        /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_READY(value)         (NVMCTRL_INTENCLR_READY_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_ERROR_Pos            _UINT32_(1)                                          /* (NVMCTRL_INTENCLR) Error Interrupt Enable Position */
#define NVMCTRL_INTENCLR_ERROR_Msk            (_UINT32_(0x1) << NVMCTRL_INTENCLR_ERROR_Pos)        /* (NVMCTRL_INTENCLR) Error Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_ERROR(value)         (NVMCTRL_INTENCLR_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_SERR_Pos             _UINT32_(8)                                          /* (NVMCTRL_INTENCLR) Single Bit Error Detection Flag bit Disable Position */
#define NVMCTRL_INTENCLR_SERR_Msk             (_UINT32_(0x1) << NVMCTRL_INTENCLR_SERR_Pos)         /* (NVMCTRL_INTENCLR) Single Bit Error Detection Flag bit Disable Mask */
#define NVMCTRL_INTENCLR_SERR(value)          (NVMCTRL_INTENCLR_SERR_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_SERR_Pos)) /* Assigment of value for SERR in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_DERR_Pos             _UINT32_(9)                                          /* (NVMCTRL_INTENCLR) Double Bit Error Detection Flag bit Disable Position */
#define NVMCTRL_INTENCLR_DERR_Msk             (_UINT32_(0x1) << NVMCTRL_INTENCLR_DERR_Pos)         /* (NVMCTRL_INTENCLR) Double Bit Error Detection Flag bit Disable Mask */
#define NVMCTRL_INTENCLR_DERR(value)          (NVMCTRL_INTENCLR_DERR_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_DERR_Pos)) /* Assigment of value for DERR in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_FLTCAP_Pos           _UINT32_(24)                                         /* (NVMCTRL_INTENCLR) Fault Capture interrupt enable bit Disable Position */
#define NVMCTRL_INTENCLR_FLTCAP_Msk           (_UINT32_(0x1) << NVMCTRL_INTENCLR_FLTCAP_Pos)       /* (NVMCTRL_INTENCLR) Fault Capture interrupt enable bit Disable Mask */
#define NVMCTRL_INTENCLR_FLTCAP(value)        (NVMCTRL_INTENCLR_FLTCAP_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_Msk                  _UINT32_(0x01000303)                                 /* (NVMCTRL_INTENCLR) Register Mask  */


/* -------- NVMCTRL_INTENSET : (NVMCTRL Offset: 0x10) (R/W 32) Interrupt Enable Set -------- */
#define NVMCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (NVMCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define NVMCTRL_INTENSET_READY_Pos            _UINT32_(0)                                          /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENSET_READY_Msk            (_UINT32_(0x1) << NVMCTRL_INTENSET_READY_Pos)        /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENSET_READY(value)         (NVMCTRL_INTENSET_READY_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_ERROR_Pos            _UINT32_(1)                                          /* (NVMCTRL_INTENSET) Error Interrupt Enable Position */
#define NVMCTRL_INTENSET_ERROR_Msk            (_UINT32_(0x1) << NVMCTRL_INTENSET_ERROR_Pos)        /* (NVMCTRL_INTENSET) Error Interrupt Enable Mask */
#define NVMCTRL_INTENSET_ERROR(value)         (NVMCTRL_INTENSET_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_SERR_Pos             _UINT32_(8)                                          /* (NVMCTRL_INTENSET) Single Bit Error Detection Flag bit Enable Position */
#define NVMCTRL_INTENSET_SERR_Msk             (_UINT32_(0x1) << NVMCTRL_INTENSET_SERR_Pos)         /* (NVMCTRL_INTENSET) Single Bit Error Detection Flag bit Enable Mask */
#define NVMCTRL_INTENSET_SERR(value)          (NVMCTRL_INTENSET_SERR_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_SERR_Pos)) /* Assigment of value for SERR in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_DERR_Pos             _UINT32_(9)                                          /* (NVMCTRL_INTENSET) Double Bit Error Detection Flag bit Enable Position */
#define NVMCTRL_INTENSET_DERR_Msk             (_UINT32_(0x1) << NVMCTRL_INTENSET_DERR_Pos)         /* (NVMCTRL_INTENSET) Double Bit Error Detection Flag bit Enable Mask */
#define NVMCTRL_INTENSET_DERR(value)          (NVMCTRL_INTENSET_DERR_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_DERR_Pos)) /* Assigment of value for DERR in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_FLTCAP_Pos           _UINT32_(24)                                         /* (NVMCTRL_INTENSET) Fault Capture interrupt enable bit Enable Position */
#define NVMCTRL_INTENSET_FLTCAP_Msk           (_UINT32_(0x1) << NVMCTRL_INTENSET_FLTCAP_Pos)       /* (NVMCTRL_INTENSET) Fault Capture interrupt enable bit Enable Mask */
#define NVMCTRL_INTENSET_FLTCAP(value)        (NVMCTRL_INTENSET_FLTCAP_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_Msk                  _UINT32_(0x01000303)                                 /* (NVMCTRL_INTENSET) Register Mask  */


/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 32) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_READY_Pos             _UINT32_(0)                                          /* (NVMCTRL_INTFLAG) NVM Ready Position */
#define NVMCTRL_INTFLAG_READY_Msk             (_UINT32_(0x1) << NVMCTRL_INTFLAG_READY_Pos)         /* (NVMCTRL_INTFLAG) NVM Ready Mask */
#define NVMCTRL_INTFLAG_READY(value)          (NVMCTRL_INTFLAG_READY_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTFLAG register */
#define   NVMCTRL_INTFLAG_READY_Val_0_Val     _UINT32_(0x0)                                        /* (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing.  */
#define   NVMCTRL_INTFLAG_READY_Val_1_Val     _UINT32_(0x1)                                        /* (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command  */
#define NVMCTRL_INTFLAG_READY_Val_0           (NVMCTRL_INTFLAG_READY_Val_0_Val << NVMCTRL_INTFLAG_READY_Pos) /* (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing. Position  */
#define NVMCTRL_INTFLAG_READY_Val_1           (NVMCTRL_INTFLAG_READY_Val_1_Val << NVMCTRL_INTFLAG_READY_Pos) /* (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command Position  */
#define NVMCTRL_INTFLAG_ERROR_Pos             _UINT32_(1)                                          /* (NVMCTRL_INTFLAG) Error Position */
#define NVMCTRL_INTFLAG_ERROR_Msk             (_UINT32_(0x1) << NVMCTRL_INTFLAG_ERROR_Pos)         /* (NVMCTRL_INTFLAG) Error Mask */
#define NVMCTRL_INTFLAG_ERROR(value)          (NVMCTRL_INTFLAG_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTFLAG register */
#define   NVMCTRL_INTFLAG_ERROR_Val_0_Val     _UINT32_(0x0)                                        /* (NVMCTRL_INTFLAG) No errors have been received since the last clear  */
#define   NVMCTRL_INTFLAG_ERROR_Val_1_Val     _UINT32_(0x1)                                        /* (NVMCTRL_INTFLAG) At least one error has occurred since the last clear  */
#define NVMCTRL_INTFLAG_ERROR_Val_0           (NVMCTRL_INTFLAG_ERROR_Val_0_Val << NVMCTRL_INTFLAG_ERROR_Pos) /* (NVMCTRL_INTFLAG) No errors have been received since the last clear Position  */
#define NVMCTRL_INTFLAG_ERROR_Val_1           (NVMCTRL_INTFLAG_ERROR_Val_1_Val << NVMCTRL_INTFLAG_ERROR_Pos) /* (NVMCTRL_INTFLAG) At least one error has occurred since the last clear Position  */
#define NVMCTRL_INTFLAG_SERR_Pos              _UINT32_(8)                                          /* (NVMCTRL_INTFLAG) Single Bit Error Detection Flag Position */
#define NVMCTRL_INTFLAG_SERR_Msk              (_UINT32_(0x1) << NVMCTRL_INTFLAG_SERR_Pos)          /* (NVMCTRL_INTFLAG) Single Bit Error Detection Flag Mask */
#define NVMCTRL_INTFLAG_SERR(value)           (NVMCTRL_INTFLAG_SERR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_SERR_Pos)) /* Assigment of value for SERR in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_DERR_Pos              _UINT32_(9)                                          /* (NVMCTRL_INTFLAG) Double bit Error detection flag Position */
#define NVMCTRL_INTFLAG_DERR_Msk              (_UINT32_(0x1) << NVMCTRL_INTFLAG_DERR_Pos)          /* (NVMCTRL_INTFLAG) Double bit Error detection flag Mask */
#define NVMCTRL_INTFLAG_DERR(value)           (NVMCTRL_INTFLAG_DERR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_DERR_Pos)) /* Assigment of value for DERR in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_FLASHERR_Pos          _UINT32_(11)                                         /* (NVMCTRL_INTFLAG) FLASH Err Position */
#define NVMCTRL_INTFLAG_FLASHERR_Msk          (_UINT32_(0x1) << NVMCTRL_INTFLAG_FLASHERR_Pos)      /* (NVMCTRL_INTFLAG) FLASH Err Mask */
#define NVMCTRL_INTFLAG_FLASHERR(value)       (NVMCTRL_INTFLAG_FLASHERR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_FLASHERR_Pos)) /* Assigment of value for FLASHERR in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_FLTCAP_Pos            _UINT32_(24)                                         /* (NVMCTRL_INTFLAG) Fault Capture Interrupt Position */
#define NVMCTRL_INTFLAG_FLTCAP_Msk            (_UINT32_(0x1) << NVMCTRL_INTFLAG_FLTCAP_Pos)        /* (NVMCTRL_INTFLAG) Fault Capture Interrupt Mask */
#define NVMCTRL_INTFLAG_FLTCAP(value)         (NVMCTRL_INTFLAG_FLTCAP_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_Msk                   _UINT32_(0x01000B03)                                 /* (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE             _UINT16_(0x00)                                       /*  (NVMCTRL_STATUS) Status  Reset Value */

#define NVMCTRL_STATUS_PRM_Pos                _UINT16_(0)                                          /* (NVMCTRL_STATUS) Power Reduction Mode Position */
#define NVMCTRL_STATUS_PRM_Msk                (_UINT16_(0x1) << NVMCTRL_STATUS_PRM_Pos)            /* (NVMCTRL_STATUS) Power Reduction Mode Mask */
#define NVMCTRL_STATUS_PRM(value)             (NVMCTRL_STATUS_PRM_Msk & (_UINT16_(value) << NVMCTRL_STATUS_PRM_Pos)) /* Assigment of value for PRM in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOAD_Pos               _UINT16_(1)                                          /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Position */
#define NVMCTRL_STATUS_LOAD_Msk               (_UINT16_(0x1) << NVMCTRL_STATUS_LOAD_Pos)           /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Mask */
#define NVMCTRL_STATUS_LOAD(value)            (NVMCTRL_STATUS_LOAD_Msk & (_UINT16_(value) << NVMCTRL_STATUS_LOAD_Pos)) /* Assigment of value for LOAD in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_PROGE_Pos              _UINT16_(2)                                          /* (NVMCTRL_STATUS) Programming Error Status Position */
#define NVMCTRL_STATUS_PROGE_Msk              (_UINT16_(0x1) << NVMCTRL_STATUS_PROGE_Pos)          /* (NVMCTRL_STATUS) Programming Error Status Mask */
#define NVMCTRL_STATUS_PROGE(value)           (NVMCTRL_STATUS_PROGE_Msk & (_UINT16_(value) << NVMCTRL_STATUS_PROGE_Pos)) /* Assigment of value for PROGE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOCKE_Pos              _UINT16_(3)                                          /* (NVMCTRL_STATUS) Lock Error Status Position */
#define NVMCTRL_STATUS_LOCKE_Msk              (_UINT16_(0x1) << NVMCTRL_STATUS_LOCKE_Pos)          /* (NVMCTRL_STATUS) Lock Error Status Mask */
#define NVMCTRL_STATUS_LOCKE(value)           (NVMCTRL_STATUS_LOCKE_Msk & (_UINT16_(value) << NVMCTRL_STATUS_LOCKE_Pos)) /* Assigment of value for LOCKE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_NVME_Pos               _UINT16_(4)                                          /* (NVMCTRL_STATUS) NVM Error Position */
#define NVMCTRL_STATUS_NVME_Msk               (_UINT16_(0x1) << NVMCTRL_STATUS_NVME_Pos)           /* (NVMCTRL_STATUS) NVM Error Mask */
#define NVMCTRL_STATUS_NVME(value)            (NVMCTRL_STATUS_NVME_Msk & (_UINT16_(value) << NVMCTRL_STATUS_NVME_Pos)) /* Assigment of value for NVME in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_SB_Pos                 _UINT16_(8)                                          /* (NVMCTRL_STATUS) Security Bit Status Position */
#define NVMCTRL_STATUS_SB_Msk                 (_UINT16_(0x1) << NVMCTRL_STATUS_SB_Pos)             /* (NVMCTRL_STATUS) Security Bit Status Mask */
#define NVMCTRL_STATUS_SB(value)              (NVMCTRL_STATUS_SB_Msk & (_UINT16_(value) << NVMCTRL_STATUS_SB_Pos)) /* Assigment of value for SB in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_Msk                    _UINT16_(0x011F)                                     /* (NVMCTRL_STATUS) Register Mask  */


