Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_cnano/pic32cm_jh01_cnano_smart_appliance_control/firmware/src/packs/PIC32CM5164JH01048_DFP/component/nvmctrl.h
/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE               _UINT32_(0x00)                                       /*  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_ADDR_Pos                 _UINT32_(0)                                          /* (NVMCTRL_ADDR) NVM Address Position */
#define NVMCTRL_ADDR_ADDR_Msk                 (_UINT32_(0x3FFFFF) << NVMCTRL_ADDR_ADDR_Pos)        /* (NVMCTRL_ADDR) NVM Address Mask */
#define NVMCTRL_ADDR_ADDR(value)              (NVMCTRL_ADDR_ADDR_Msk & (_UINT32_(value) << NVMCTRL_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the NVMCTRL_ADDR register */
#define NVMCTRL_ADDR_Msk                      _UINT32_(0x003FFFFF)                                 /* (NVMCTRL_ADDR) Register Mask  */


/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Section -------- */
#define NVMCTRL_LOCK_RESETVALUE               _UINT16_(0x00)                                       /*  (NVMCTRL_LOCK) Lock Section  Reset Value */

#define NVMCTRL_LOCK_LOCK_Pos                 _UINT16_(0)                                          /* (NVMCTRL_LOCK) Region Lock Bits Position */
#define NVMCTRL_LOCK_LOCK_Msk                 (_UINT16_(0xFFFF) << NVMCTRL_LOCK_LOCK_Pos)          /* (NVMCTRL_LOCK) Region Lock Bits Mask */
#define NVMCTRL_LOCK_LOCK(value)              (NVMCTRL_LOCK_LOCK_Msk & (_UINT16_(value) << NVMCTRL_LOCK_LOCK_Pos)) /* Assigment of value for LOCK in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_Msk                      _UINT16_(0xFFFF)                                     /* (NVMCTRL_LOCK) Register Mask  */


/* -------- NVMCTRL_PBLDATA0 : (NVMCTRL Offset: 0x28) ( R/ 32) Page Buffer Load Data 0 -------- */
#define NVMCTRL_PBLDATA0_RESETVALUE           _UINT32_(0xFFFFFFFF)                                 /*  (NVMCTRL_PBLDATA0) Page Buffer Load Data 0  Reset Value */

#define NVMCTRL_PBLDATA0_PBLDATA_Pos          _UINT32_(0)                                          /* (NVMCTRL_PBLDATA0) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA0_PBLDATA_Msk          (_UINT32_(0xFFFFFFFF) << NVMCTRL_PBLDATA0_PBLDATA_Pos) /* (NVMCTRL_PBLDATA0) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA0_PBLDATA(value)       (NVMCTRL_PBLDATA0_PBLDATA_Msk & (_UINT32_(value) << NVMCTRL_PBLDATA0_PBLDATA_Pos)) /* Assigment of value for PBLDATA in the NVMCTRL_PBLDATA0 register */
#define NVMCTRL_PBLDATA0_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (NVMCTRL_PBLDATA0) Register Mask  */


/* -------- NVMCTRL_PBLDATA1 : (NVMCTRL Offset: 0x2C) ( R/ 32) Page Buffer Load Data 1 -------- */
#define NVMCTRL_PBLDATA1_RESETVALUE           _UINT32_(0xFFFFFFFF)                                 /*  (NVMCTRL_PBLDATA1) Page Buffer Load Data 1  Reset Value */

#define NVMCTRL_PBLDATA1_PBLDATA_Pos          _UINT32_(0)                                          /* (NVMCTRL_PBLDATA1) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA1_PBLDATA_Msk          (_UINT32_(0xFFFFFFFF) << NVMCTRL_PBLDATA1_PBLDATA_Pos) /* (NVMCTRL_PBLDATA1) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA1_PBLDATA(value)       (NVMCTRL_PBLDATA1_PBLDATA_Msk & (_UINT32_(value) << NVMCTRL_PBLDATA1_PBLDATA_Pos)) /* Assigment of value for PBLDATA in the NVMCTRL_PBLDATA1 register */
#define NVMCTRL_PBLDATA1_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (NVMCTRL_PBLDATA1) Register Mask  */


/* -------- NVMCTRL_ECCCTRL : (NVMCTRL Offset: 0x80) (R/W 16) ECC control -------- */
#define NVMCTRL_ECCCTRL_RESETVALUE            _UINT16_(0x00)                                       /*  (NVMCTRL_ECCCTRL) ECC control  Reset Value */

#define NVMCTRL_ECCCTRL_ECCDIS_Pos            _UINT16_(0)                                          /* (NVMCTRL_ECCCTRL) FLASH ECC Disable Position */
#define NVMCTRL_ECCCTRL_ECCDIS_Msk            (_UINT16_(0x1) << NVMCTRL_ECCCTRL_ECCDIS_Pos)        /* (NVMCTRL_ECCCTRL) FLASH ECC Disable Mask */
#define NVMCTRL_ECCCTRL_ECCDIS(value)         (NVMCTRL_ECCCTRL_ECCDIS_Msk & (_UINT16_(value) << NVMCTRL_ECCCTRL_ECCDIS_Pos)) /* Assigment of value for ECCDIS in the NVMCTRL_ECCCTRL register */
#define   NVMCTRL_ECCCTRL_ECCDIS_En_Val       _UINT16_(0x0)                                        /* (NVMCTRL_ECCCTRL) Flash ECC is Enabled  */
#define   NVMCTRL_ECCCTRL_ECCDIS_Dis_Val      _UINT16_(0x1)                                        /* (NVMCTRL_ECCCTRL) Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset  */
#define NVMCTRL_ECCCTRL_ECCDIS_En             (NVMCTRL_ECCCTRL_ECCDIS_En_Val << NVMCTRL_ECCCTRL_ECCDIS_Pos) /* (NVMCTRL_ECCCTRL) Flash ECC is Enabled Position  */
#define NVMCTRL_ECCCTRL_ECCDIS_Dis            (NVMCTRL_ECCCTRL_ECCDIS_Dis_Val << NVMCTRL_ECCCTRL_ECCDIS_Pos) /* (NVMCTRL_ECCCTRL) Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset Position  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Pos          _UINT16_(1)                                          /* (NVMCTRL_ECCCTRL) Data Flash ECC Disable Position */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Msk          (_UINT16_(0x1) << NVMCTRL_ECCCTRL_ECCDFDIS_Pos)      /* (NVMCTRL_ECCCTRL) Data Flash ECC Disable Mask */
#define NVMCTRL_ECCCTRL_ECCDFDIS(value)       (NVMCTRL_ECCCTRL_ECCDFDIS_Msk & (_UINT16_(value) << NVMCTRL_ECCCTRL_ECCDFDIS_Pos)) /* Assigment of value for ECCDFDIS in the NVMCTRL_ECCCTRL register */
#define   NVMCTRL_ECCCTRL_ECCDFDIS_En_Val     _UINT16_(0x0)                                        /* (NVMCTRL_ECCCTRL) Data Flash ECC is Enabled  */
#define   NVMCTRL_ECCCTRL_ECCDFDIS_Dis_Val    _UINT16_(0x1)                                        /* (NVMCTRL_ECCCTRL) Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_En           (NVMCTRL_ECCCTRL_ECCDFDIS_En_Val << NVMCTRL_ECCCTRL_ECCDFDIS_Pos) /* (NVMCTRL_ECCCTRL) Data Flash ECC is Enabled Position  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Dis          (NVMCTRL_ECCCTRL_ECCDFDIS_Dis_Val << NVMCTRL_ECCCTRL_ECCDFDIS_Pos) /* (NVMCTRL_ECCCTRL) Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset Position  */
#define NVMCTRL_ECCCTRL_SECCNT_Pos            _UINT16_(8)                                          /* (NVMCTRL_ECCCTRL) Flash SEC Count Position */
#define NVMCTRL_ECCCTRL_SECCNT_Msk            (_UINT16_(0xFF) << NVMCTRL_ECCCTRL_SECCNT_Pos)       /* (NVMCTRL_ECCCTRL) Flash SEC Count Mask */
#define NVMCTRL_ECCCTRL_SECCNT(value)         (NVMCTRL_ECCCTRL_SECCNT_Msk & (_UINT16_(value) << NVMCTRL_ECCCTRL_SECCNT_Pos)) /* Assigment of value for SECCNT in the NVMCTRL_ECCCTRL register */
#define NVMCTRL_ECCCTRL_Msk                   _UINT16_(0xFF03)                                     /* (NVMCTRL_ECCCTRL) Register Mask  */


/* -------- NVMCTRL_FLTCTRL : (NVMCTRL Offset: 0x84) (R/W 16) Fault injection control -------- */
#define NVMCTRL_FLTCTRL_RESETVALUE            _UINT16_(0x00)                                       /*  (NVMCTRL_FLTCTRL) Fault injection control  Reset Value */

#define NVMCTRL_FLTCTRL_FLTRST_Pos            _UINT16_(0)                                          /* (NVMCTRL_FLTCTRL) Fault reset Position */
#define NVMCTRL_FLTCTRL_FLTRST_Msk            (_UINT16_(0x1) << NVMCTRL_FLTCTRL_FLTRST_Pos)        /* (NVMCTRL_FLTCTRL) Fault reset Mask */
#define NVMCTRL_FLTCTRL_FLTRST(value)         (NVMCTRL_FLTCTRL_FLTRST_Msk & (_UINT16_(value) << NVMCTRL_FLTCTRL_FLTRST_Pos)) /* Assigment of value for FLTRST in the NVMCTRL_FLTCTRL register */
#define   NVMCTRL_FLTCTRL_FLTRST_Val_0_Val    _UINT16_(0x0)                                        /* (NVMCTRL_FLTCTRL) No Effect  */
#define   NVMCTRL_FLTCTRL_FLTRST_Val_1_Val    _UINT16_(0x1)                                        /* (NVMCTRL_FLTCTRL) Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN}  */
#define NVMCTRL_FLTCTRL_FLTRST_Val_0          (NVMCTRL_FLTCTRL_FLTRST_Val_0_Val << NVMCTRL_FLTCTRL_FLTRST_Pos) /* (NVMCTRL_FLTCTRL) No Effect Position  */
#define NVMCTRL_FLTCTRL_FLTRST_Val_1          (NVMCTRL_FLTCTRL_FLTRST_Val_1_Val << NVMCTRL_FLTCTRL_FLTRST_Pos) /* (NVMCTRL_FLTCTRL) Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN} Position  */
#define NVMCTRL_FLTCTRL_FLTEN_Pos             _UINT16_(1)                                          /* (NVMCTRL_FLTCTRL) Fault Injection Enabled Position */
#define NVMCTRL_FLTCTRL_FLTEN_Msk             (_UINT16_(0x1) << NVMCTRL_FLTCTRL_FLTEN_Pos)         /* (NVMCTRL_FLTCTRL) Fault Injection Enabled Mask */
#define NVMCTRL_FLTCTRL_FLTEN(value)          (NVMCTRL_FLTCTRL_FLTEN_Msk & (_UINT16_(value) << NVMCTRL_FLTCTRL_FLTEN_Pos)) /* Assigment of value for FLTEN in the NVMCTRL_FLTCTRL register */
#define   NVMCTRL_FLTCTRL_FLTEN_Dis_Val       _UINT16_(0x0)                                        /* (NVMCTRL_FLTCTRL) Disables the Write/Read fault injection  */
#define   NVMCTRL_FLTCTRL_FLTEN_En_Val        _UINT16_(0x1)                                        /* (NVMCTRL_FLTCTRL) Enables the Write/Read fault injection to occur selected by FLTMD  */
#define NVMCTRL_FLTCTRL_FLTEN_Dis             (NVMCTRL_FLTCTRL_FLTEN_Dis_Val << NVMCTRL_FLTCTRL_FLTEN_Pos) /* (NVMCTRL_FLTCTRL) Disables the Write/Read fault injection Position  */
#define NVMCTRL_FLTCTRL_FLTEN_En              (NVMCTRL_FLTCTRL_FLTEN_En_Val << NVMCTRL_FLTCTRL_FLTEN_Pos) /* (NVMCTRL_FLTCTRL) Enables the Write/Read fault injection to occur selected by FLTMD Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Pos             _UINT16_(12)                                         /* (NVMCTRL_FLTCTRL) Fault Mode Control Position */
#define NVMCTRL_FLTCTRL_FLTMD_Msk             (_UINT16_(0x7) << NVMCTRL_FLTCTRL_FLTMD_Pos)         /* (NVMCTRL_FLTCTRL) Fault Mode Control Mask */
#define NVMCTRL_FLTCTRL_FLTMD(value)          (NVMCTRL_FLTCTRL_FLTMD_Msk & (_UINT16_(value) << NVMCTRL_FLTCTRL_FLTMD_Pos)) /* Assigment of value for FLTMD in the NVMCTRL_FLTCTRL register */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_0_Val     _UINT16_(0x0)                                        /* (NVMCTRL_FLTCTRL) Fault Injection Disabled  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_2_Val     _UINT16_(0x2)                                        /* (NVMCTRL_FLTCTRL) Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND))  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_4_Val     _UINT16_(0x4)                                        /* (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Reads  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_5_Val     _UINT16_(0x5)                                        /* (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_6_Val     _UINT16_(0x6)                                        /* (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Writes  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_7_Val     _UINT16_(0x7)                                        /* (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_0           (NVMCTRL_FLTCTRL_FLTMD_Val_0_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Fault Injection Disabled Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_2           (NVMCTRL_FLTCTRL_FLTMD_Val_2_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND)) Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_4           (NVMCTRL_FLTCTRL_FLTMD_Val_4_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Reads Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_5           (NVMCTRL_FLTCTRL_FLTMD_Val_5_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_6           (NVMCTRL_FLTCTRL_FLTMD_Val_6_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Writes Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_7           (NVMCTRL_FLTCTRL_FLTMD_Val_7_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /* (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes Position  */
#define NVMCTRL_FLTCTRL_Msk                   _UINT16_(0x7003)                                     /* (NVMCTRL_FLTCTRL) Register Mask  */


/* -------- NVMCTRL_FFLTPTR : (NVMCTRL Offset: 0x88) (R/W 32) Fault injection pointer -------- */
#define NVMCTRL_FFLTPTR_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_FFLTPTR) Fault injection pointer  Reset Value */

#define NVMCTRL_FFLTPTR_FLT1PTR_Pos           _UINT32_(0)                                          /* (NVMCTRL_FFLTPTR) Fault Injection Pointer 1 Position */
#define NVMCTRL_FFLTPTR_FLT1PTR_Msk           (_UINT32_(0xFF) << NVMCTRL_FFLTPTR_FLT1PTR_Pos)      /* (NVMCTRL_FFLTPTR) Fault Injection Pointer 1 Mask */
#define NVMCTRL_FFLTPTR_FLT1PTR(value)        (NVMCTRL_FFLTPTR_FLT1PTR_Msk & (_UINT32_(value) << NVMCTRL_FFLTPTR_FLT1PTR_Pos)) /* Assigment of value for FLT1PTR in the NVMCTRL_FFLTPTR register */
#define NVMCTRL_FFLTPTR_FLT2PTR_Pos           _UINT32_(16)                                         /* (NVMCTRL_FFLTPTR) Fault Injection pointer 2 Position */
#define NVMCTRL_FFLTPTR_FLT2PTR_Msk           (_UINT32_(0xFF) << NVMCTRL_FFLTPTR_FLT2PTR_Pos)      /* (NVMCTRL_FFLTPTR) Fault Injection pointer 2 Mask */
#define NVMCTRL_FFLTPTR_FLT2PTR(value)        (NVMCTRL_FFLTPTR_FLT2PTR_Msk & (_UINT32_(value) << NVMCTRL_FFLTPTR_FLT2PTR_Pos)) /* Assigment of value for FLT2PTR in the NVMCTRL_FFLTPTR register */
#define NVMCTRL_FFLTPTR_Msk                   _UINT32_(0x00FF00FF)                                 /* (NVMCTRL_FFLTPTR) Register Mask  */


/* -------- NVMCTRL_FFLTADR : (NVMCTRL Offset: 0x8C) (R/W 32) Fault injection address -------- */
#define NVMCTRL_FFLTADR_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_FFLTADR) Fault injection address  Reset Value */

#define NVMCTRL_FFLTADR_FLTADR_Pos            _UINT32_(0)                                          /* (NVMCTRL_FFLTADR) Fault Injection Address Position */
#define NVMCTRL_FFLTADR_FLTADR_Msk            (_UINT32_(0xFFFFFF) << NVMCTRL_FFLTADR_FLTADR_Pos)   /* (NVMCTRL_FFLTADR) Fault Injection Address Mask */
#define NVMCTRL_FFLTADR_FLTADR(value)         (NVMCTRL_FFLTADR_FLTADR_Msk & (_UINT32_(value) << NVMCTRL_FFLTADR_FLTADR_Pos)) /* Assigment of value for FLTADR in the NVMCTRL_FFLTADR register */
#define NVMCTRL_FFLTADR_Msk                   _UINT32_(0x00FFFFFF)                                 /* (NVMCTRL_FFLTADR) Register Mask  */


/* -------- NVMCTRL_FFLTCAP : (NVMCTRL Offset: 0x90) ( R/ 32) Fault error capture addr -------- */
#define NVMCTRL_FFLTCAP_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_FFLTCAP) Fault error capture addr  Reset Value */

